{
  "version": "https://jsonfeed.org/version/1",
  "title": "Dmitrii&#39;s tech blog",
  "home_page_url": "https://dushkin.tech",
  "feed_url": "https://dushkin.tech/feed/feed.json",
  "description": "Software engineering and beyond",
  "author": {
    "name": "Dmitrii Dushkin",
    "url": ""
  },
  "items": [{
      "id": "https://dushkin.tech/posts/when_you_overwhelmed_simplify/",
      "url": "https://dushkin.tech/posts/when_you_overwhelmed_simplify/",
      "title": "When You’re overwhelmed, simplify",
      "content_html": "<p><em>by Nataliia Dushkina (<a href=\"https://github.com/indra-uolles\">https://github.com/indra-uolles</a>)</em></p>\n<p>When I saw this phrase, I felt that somebody had crept into my head and was stealing thoughts out of it :D Seriously, it’s one of my main work principles that I try to follow.</p>\n<p>Let me give an example of how to use this principle when you work as a front-end developer.</p>\n<p>Not long ago, I was involved in large legacy project update tasks. Its current front-end framework version was 2, and we were going to promise that we’ll update it to 13 quickly enough.</p>\n<p>There was a problem, though. Several people tried to do a proper update (like it’s advised in official docs) to the next version, but they encountered different weird bugs and got stuck. To understand these errors, one would have to be a real open-source ninja. The Update task was starting to seem impossible.</p>\n<p>As a former scientist, I know that when there is a <em>BIG, UNKNOWN SMTH</em>, you have to find a small piece you can do and try to understand this by chewing off that little piece first. So I asked our team lead to give me a couple of days to test a minor jump update to version 5. He wasn’t happy about my suggestion, but since no one had better recommendations, he allowed me to do it.</p>\n<p>The first thing I did was remove auth code from backend. I commented out some things and hardcoded others, so the backend would always think I’m a particular user who is logged in. Then I created a new project from a template with framework version 5 and started to restore a little feature by dragging little pieces of code from the old front-end.</p>\n<p>Everybody kept telling me that it was ineffective and would take too much time to update the whole project this way. I kept saying it was just a little investigation which I’ll be ready to drop as soon as somebody found a better approach. After a couple of days, another developer joined me, though he was still sceptical about all these “pieces dragging”.</p>\n<p>Guess what? After another couple of days doing this, he suddenly understood how this legacy app differs from a typical app created with such framework. Now he was able to jump update to version 5 all the codebase. He spent several days doing that and succeeded.</p>\n<p>In other words, my piece of advice <strong>is if you see something big you don’t know how to tackle, think about what little investigation you could do, even if deadlines are harsh.</strong></p>\n",
      "date_published": "2022-11-10T00:00:00-00:00"
    },{
      "id": "https://dushkin.tech/posts/HP_U28_for_work_and_gaming_review/",
      "url": "https://dushkin.tech/posts/HP_U28_for_work_and_gaming_review/",
      "title": "HP U28 for work and gaming review",
      "content_html": "<p>So after trying some monitors I decided to buy HP U28. I had some surprises after, but overall it is a good monitor for its price (500 pounds in July 2021).<br>\nMy must have features for monitor are:</p>\n<ul>\n<li><strong>4K for text clarity</strong>. I read a lot of texts and write a lot of code, so it is crucial for me the see text perfectly. Also only 4K monitors are recognised by MacOS as &quot;retina&quot; and you can scale MacOS UI without any blurring.</li>\n<li><strong>USB-C with power delivery</strong> at least 65W and built-in USB hub. It allows to use a single cable for charging, video output, connecting keyboard and mouse.</li>\n<li><strong>HDR</strong>. This technology introduces luminance along with pixel colour. Also monitor should support wider colour range like DCI-P3. It is not crucial, but a nice addition for a low extra price for entry level HDR.</li>\n</ul>\n<p><img src=\"/img/for_posts/02/hp_u28.jpeg\" alt=\"HP U28\"></p>\n<p>I have 3 devices to plug into this monitor: my work MacBook 16, gaming laptop and PS5.</p>\n<h2 id=\"for-work\">For work <a class=\"direct-link\" href=\"#for-work\">#</a></h2>\n<p><strong>For working on MacBook, it is perfect</strong>. I give here 5 stars. It provides good text clarity, but not the best possible, probably because 28&quot; is a little too big for 4K. I had previously old Dell 27&quot; 4K, and it was perfect. Also, HP u28 gives HDR out of the box and 10-bit colours on each channel. It has just entry level HDR 400, which means maximum brightness limited with 400 nits. For comparison iPhone 12 has maximum brightness 1200 nits.</p>\n<h2 id=\"for-gaming-on-pc\">For gaming on PC <a class=\"direct-link\" href=\"#for-gaming-on-pc\">#</a></h2>\n<p><strong>For gaming on PC, I give it 3.5 stars</strong>. I have a laptop with GeForce 2070, and it has DisplayPort 1.4 over USB-C (Thunderbolt) and HDMI 2.0. It turned out (well, it was in specs, actually) monitor have only DisplayPort 1.2 (!), which do not support HDR officially. I had a lot of trouble getting it right.</p>\n<p>There are two options for me in this setup. <strong>First is to use USB-C to USB-C connection</strong>, which allows leave keyboard and mouse plugged into monitor, but there are many troubles with HDR. For some reason, HDR can be turned on in Windows 10. I do not know why because there is no such thing in DP 1.2 specs. But anyway, when I am turning on HDR, setting 10-bit RGB, everything seems fine until I'll start some game, and it immediately resets to 6-bit (!) with awful colour banding. Colour banding is when you see clear colour steps in gradients, like back in 1995. I can switch from RBG (native) to YCbCr 4:4:4 (it is a colour compression method), but I get limited colour, and I see colour banding as well, but not so bad as if it was on 6 bit. So after killing a lot of time on it, I decided to turn off HDR in Windows and enjoy 8 bit RGB with a Photo colour profile. Sometimes I select YCbCr 4:4:4 10 bit + HDR because it is a bit better in darker games, but as I said this options gives noticeable color banding.</p>\n<p><img src=\"/img/for_posts/02/color_banding.jpeg\" alt=\"Color banding\"><br>\n<em>Color banding on the left</em></p>\n<p><strong>Another option for gaming PC</strong> is to hook up HDMI. It works well on HDR 8-bit RGB, but I have to manually reconnect the mouse and keyboard from monitor to laptop. I hate wires on a desk and all this manual switching, so it is not for me. Maybe I'll make up something for this later.</p>\n<p>By the way, there is <strong>no official G-SYNC support (only AMD FreeSync)</strong>. Although Nvidia Control Panel allows to turn on G-SYNC, it just not working. I see awful screen tearing in games, so I turned on VSYNC in games (it's like a software solution to screen tearing problem, but not so efficient). There is such an option for DisplayPort connection, but HDMI lucks it.</p>\n<h2 id=\"for-gaming-on-ps5\">For gaming on PS5 <a class=\"direct-link\" href=\"#for-gaming-on-ps5\">#</a></h2>\n<p>And the last one is PS5, and the monitor gets 5 stars here. HDR looks amazing, true 4K. I cannot complain here. Also, I bought a 5wt soundbar (costs around 20 quids) and connected it to the monitor. This setup gives decent sound for PS 5 games.</p>\n<h2 id=\"dimming-zones\">Dimming zones <a class=\"direct-link\" href=\"#dimming-zones\">#</a></h2>\n<p>I've noticed there are actually dimming zones, but they are quite simple and consists of top and bottom array lightning. Here is the video:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/nVxh1Hwyiks\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<h2 id=\"conclusion\">Conclusion <a class=\"direct-link\" href=\"#conclusion\">#</a></h2>\n<p>I guess this is just the best option for its price for me. Better solutions in terms of PC gaming starts from 800 quids (if you need 4K), that is not I'm ready to spend now. I'll wait until OLED or mini-LED monitors will become affordable for better HDR and HDMI 2.1 for better PS5 experience.</p>\n",
      "date_published": "2022-11-10T00:00:00-00:00"
    },{
      "id": "https://dushkin.tech/posts/js_assign_variable_in_switch/",
      "url": "https://dushkin.tech/posts/js_assign_variable_in_switch/",
      "title": "How to assign a variable to switch statement result",
      "content_html": "<p>It’s a helpful trick that allows writing compact yet highly type-proof code to deal with enums both in TypeScript and Flow.</p>\n<pre class=\"language-js\"><code class=\"language-js\"><span class=\"token keyword\">const</span> result <span class=\"token operator\">=</span> <span class=\"token punctuation\">(</span><span class=\"token keyword\">function</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">switch</span> <span class=\"token punctuation\">(</span>step<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">case</span> Step<span class=\"token punctuation\">.</span>One<span class=\"token operator\">:</span><br>      <span class=\"token keyword\">return</span> <span class=\"token punctuation\">{</span> <span class=\"token literal-property property\">one</span><span class=\"token operator\">:</span> <span class=\"token number\">1</span> <span class=\"token punctuation\">}</span><span class=\"token punctuation\">;</span><br>    <span class=\"token keyword\">case</span> Step<span class=\"token punctuation\">.</span>Two<span class=\"token operator\">:</span><br>      <span class=\"token keyword\">return</span> <span class=\"token punctuation\">{</span> <span class=\"token literal-property property\">two</span><span class=\"token operator\">:</span> <span class=\"token number\">2</span> <span class=\"token punctuation\">}</span><span class=\"token punctuation\">;</span><br>    <span class=\"token keyword\">case</span> Step<span class=\"token punctuation\">.</span>Three<span class=\"token operator\">:</span><br>      <span class=\"token keyword\">return</span> <span class=\"token punctuation\">{</span> <span class=\"token literal-property property\">three</span><span class=\"token operator\">:</span> <span class=\"token number\">4</span> <span class=\"token punctuation\">}</span><span class=\"token punctuation\">;</span><br>  <span class=\"token punctuation\">}</span><br><span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span></code></pre>\n<p>I use in React <code>render</code> as well.</p>\n",
      "date_published": "2022-11-07T00:00:00-00:00"
    },{
      "id": "https://dushkin.tech/posts/principles_of_engineering_excellence/",
      "url": "https://dushkin.tech/posts/principles_of_engineering_excellence/",
      "title": "Principles of engineering excellence",
      "content_html": "<p>For the past 12 years of creating software for money, I started to sense the presence of <strong>generic principles of engineering excellence</strong>. This sense includes not only code decisions but also concepts around software development: collaboration, management, product evolvement and others. Violating these rules feels like &quot;bad smells&quot; mentioned in [[&quot;Refactoring&quot; by Martin Fowler]] but more generically.</p>\n<p>I plan to update this note from time to time because the &quot;sense&quot; mentioned above is blurry, and so is the interpretation.</p>\n<h2 id=\"core-principles\">Core principles <a class=\"direct-link\" href=\"#core-principles\">#</a></h2>\n<ul>\n<li>Engineering excellence is a process of <strong>harnessing codebase chaos</strong> by reducing an <strong>entropy</strong></li>\n<li>Code should have a structure <strong>simple for a fast high-level understanding</strong></li>\n<li>Logic is understandable from code and has no surprises, i.e. no hidden dependencies and unexpected side-effects</li>\n</ul>\n<h2 id=\"why\">Why <a class=\"direct-link\" href=\"#why\">#</a></h2>\n<ul>\n<li>Eventually, to <strong>make a better product</strong>!</li>\n<li>Keep a <strong>good developer experience</strong> tightly connected to a result.</li>\n</ul>\n<h2 id=\"how\">How <a class=\"direct-link\" href=\"#how\">#</a></h2>\n<ul>\n<li><strong>Reducing amount of code</strong> by introducing re-usable modules\n<ul>\n<li>Make reusable code the best quality possible: it's fast, covers edge cases, and is fully specified by documentation and tests.</li>\n<li><strong>Reusable code is s a foundation of a technical side of a product. This code includes libraries and frameworks.</strong></li>\n</ul>\n</li>\n<li><strong>End-to-end (E2E) and unit-tests</strong></li>\n<li><strong>Knowledge sharing</strong>: documentation (inc. good doc in E2E tests), internal talks, etc.</li>\n</ul>\n<h2 id=\"trade-offs\">Trade-offs <a class=\"direct-link\" href=\"#trade-offs\">#</a></h2>\n<p>Engineering excellence is <strong>not an ultimate goal</strong> (see &quot;Why&quot;). These aspects of product development should be taken into consideration each time before investing time in engineering excellence:</p>\n<ul>\n<li><strong>Product maturity</strong>\n<ul>\n<li>E.g. there is no sense in investing in own components library to build an MVP</li>\n</ul>\n</li>\n<li><strong>Team maturity</strong>\n<ul>\n<li>E.g. you'll likely create a good custom ORM if you delegate this task to a junior developer, at least in a reasonable amount of time.</li>\n</ul>\n</li>\n<li><strong>Business reasons</strong>\n<ul>\n<li>E.g. writing end-to-end tests for features which likely to be dropped.</li>\n</ul>\n</li>\n</ul>\n",
      "date_published": "2022-11-06T00:00:00-00:00"
    },{
      "id": "https://dushkin.tech/posts/my_productivity_tools/",
      "url": "https://dushkin.tech/posts/my_productivity_tools/",
      "title": "My productivity tools",
      "content_html": "<p>I like to make my everyday work and life-related tasks faster: taking notes, remembering passwords, arranging windows and maintain things to do.</p>\n<p>I want to share software and a bit of hardware gems I found during 20+ years of sharpening the &quot;Second brain&quot; blade. For me, it's also an opportunity to reflect.</p>\n<blockquote>\n<p>Most of the time, I use Apple devices and very little — Windows, so keep this in mind, and I'll try to highlight if there is a Windows version of the software.</p>\n</blockquote>\n<h2 id=\"tldr\">TLDR <a class=\"direct-link\" href=\"#tldr\">#</a></h2>\n<ul>\n<li>Remember things in short-term:\n<ul>\n<li>Apple Reminder</li>\n<li>Apple Notes</li>\n<li>Google Calendar</li>\n</ul>\n</li>\n<li>Personal Knowledge Management (long-term memory):\n<ul>\n<li>Notion</li>\n<li>Obsidian</li>\n<li>LucidChart</li>\n<li>Yandex.Disk</li>\n</ul>\n</li>\n<li>System control:\n<ul>\n<li>Raycast</li>\n<li>Lunar</li>\n<li>ITerm 2</li>\n</ul>\n</li>\n<li>Other\n<ul>\n<li>Keyboards: NuPhy Air 60 and Dygma Raise</li>\n<li>Timeout</li>\n<li>Grammarly</li>\n<li>MacPass</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"remember-things-in-short-term\">Remember things in short-term <a class=\"direct-link\" href=\"#remember-things-in-short-term\">#</a></h2>\n<p>There are myriads of everyday things which I should remember for a long: scheduled appointments, reminders to pay bills, watch a movie, order something, etc. To free up a bit of memory I use these tools.</p>\n<p><strong>Apple Reminder</strong></p>\n<ul>\n<li>Using reminders as is. I often use Siri to create a reminder like &quot;Hey Siri, remind me in 5 hours to scan a document&quot;. A cool benefit of the highly-coupled Apple eco-system.</li>\n<li>Also using it to keep lists of:\n<ul>\n<li>Books to read</li>\n<li>Movies to watch</li>\n<li>Games to play</li>\n</ul>\n</li>\n<li>Platforms: macOS, iPadOS, iOS.</li>\n</ul>\n<p><img src=\"/img/for_posts/01/reminder.png\" alt=\"...\"></p>\n<p><strong>Apple Notes</strong></p>\n<ul>\n<li>Mostly using it for Quick Notes (TM). Again thanks to good integration with iOS and macOS, it's quite a convenient way to quickly write down a thought or save a link with comments. For instance, when exploring Unreal Engine 5, I often clicked on &quot;Share&quot; in the iOS YouTube app, shared the video via Notes, and added a small comment on what this video was about.</li>\n<li>Sometimes, use it to draw some diagrams. Good enough for a rough sketch but hardly for sharing the result with someone else. Or I suck at drawing :)</li>\n<li>I tried to use it as a main note-taking app, but it lacks many must-have features. Number one is interlinking between notes. On the good side, Apple started investing in it and recently, Apple added must-have things like tags or tables.</li>\n<li>Platforms: macOS, iPadOS, iOS.</li>\n</ul>\n<p><img src=\"/img/for_posts/01/notes.png\" alt=\"...\"></p>\n<p><strong><a href=\"https://bear.app\">Bear</a></strong></p>\n<ul>\n<li>Honorable mention. I'm not using it anymore because Apple Notes has become good enough for the same tasks. But still, it has one of the nicest UI and UX (user experience) I ever saw both desktop and mobile. It's still worth trying if Apple Notes already cover your needs, but you're looking for a bit more features like:</li>\n<li>Natural markdown format for notes,</li>\n<li>Notes interlinking (more on that later, but that's potentially a huge one!),</li>\n<li>Themes!</li>\n<li>Platforms: macOS, iPadOS, iOS.</li>\n</ul>\n<p><img src=\"/img/for_posts/01/bear.png\" alt=\"...\"></p>\n<p><strong>Google Calendar added to Apple Calendar</strong></p>\n<ul>\n<li>Besides covering obvious needs like adding doctor appointments, birthdays, etc. I made a shared calendar with my relatives and added events like joint trips.</li>\n<li>Tried to use it as a weekly schedule (set exact wake-up time, breakfast, work, gym, etc.), but it never lifted off. Maybe it's just a little too much &quot;productivity&quot; for me :), but if YouTube &quot;productivity&quot; experts are not lying to make more content, this kind of &quot;full-scheduled life&quot; works for some people.</li>\n<li>Platforms: macOS, iPadOS, iOS, but Google Calendar itself can be integrated almost to every mail/calendar app.</li>\n</ul>\n<h2 id=\"personal-knowledge-management\">Personal Knowledge Management <a class=\"direct-link\" href=\"#personal-knowledge-management\">#</a></h2>\n<p>Although Apple Notes and Reminders are also used for preserving some knowledge, they do not offer any suitable (for me) experience for:</p>\n<ul>\n<li>Keeping long-lasting information,</li>\n<li>Research and learning,</li>\n<li>Writing long formats like articles or posts,</li>\n<li>Exploring and finding connections between existing information,</li>\n<li>Sharing information.</li>\n</ul>\n<p>And that's fine. Apple's apps are good at quick information capture (in terms of performance and smooth UX for common tasks), but not for things I mentioned above. I guess it's almost impossible to have everything in a single app. 🤷‍♂️</p>\n<p><strong><a href=\"https://www.notion.so\">Notion</a></strong></p>\n<ul>\n<li>It's my primary app for capturing personal life-related info, i.e. tips for passing IELTS, physical exercises, medical information, learning materials, etc.</li>\n<li>It has quite a simple way to share notes, which I'm using for sharing information with relatives.</li>\n<li>It has a cool UI around managing its databases and presents it in several ways (tables, kanban, etc.).\n<ul>\n<li>For instance was using it for gathering structured info about routers or notebooks before buying ones. Price, performance, average temperature, etc., are all important factors affecting buying decisions.</li>\n<li>But truth be told, it could be more useful as advertised. At least I didn't find any other good scenarios for personal use. I tried keeping it in the database todo-list, but managing it took more time than giving a profit.</li>\n</ul>\n</li>\n<li>Pricing model is quite affordable. Free-tier also works (recently, they expanded it so you can have an unlimited number of notes).</li>\n<li>Platforms: all.</li>\n</ul>\n<p><img src=\"/img/for_posts/01/notion.png\" alt=\"notion\"></p>\n<p><strong>Obsidian</strong></p>\n<ul>\n<li>It's a new tool in my belt. They recently released a 1.0.0. It has MacOS, iOS (both iPhone and iPad versions) and Windows versions.</li>\n<li>I'm exploring ways of using it for research work and writing articles based on research. I guess it's just my habit from science days when I was gathering a lot of sources before doing anything and verifying that my work makes sense :)</li>\n<li>There are several features which make Obisidian a much more suitable tool for research and long-format writing compared to Notion:\n<ul>\n<li>The major one is graph-like knowledge structuring support. Yes, you can put your notes in folders like Notion or Apple Notes, but that's not the main one.\n<ul>\n<li>Evangelists of graph-based solutions (sometimes called &quot;Zattelcasten&quot;) say that the natural way of thinking for our brain is a network of connections between pieces of information, not a hierarchical structure which Notion or Notes offer.</li>\n<li>Practically speaking, this feature is more about habit than technology. You can quickly add links to other notes and see information about back-links (notes which refer to current note). And that's it! So you can think of it as a swift and responsive personal Wikipedia.</li>\n<li>The habit is creating links to essential entities in the text while you are typing or reading. That's easy when you get used to it. You need to type `` and start typing the term you're going to mention and see if there is an already existing note. If not, that's not a problem; leave it as a link. Obsidian will create an empty note for you, so next time will see at least that some pages refer to the corresponding note.</li>\n<li>People also say that graph-representation of notes also helps to indent if hidden relationships between data which can be valuable.</li>\n<li>Anyway. I have tried the tool briefly to say how it all works in practice. Will see. I like the concept so far.</li>\n</ul>\n</li>\n<li>The next one is that it's entirely local! So I can not worry about your data integrity to some degree. Also, it does search and linking very fast. And you get a natural offline mode (<em>cough-Notion-cough</em>) :)</li>\n<li>It's based on a markdown format, making migration or co-using notes in other apps (like Logseq) easy.</li>\n<li>There are several helpful community plugins like better UX for creating tables, managing tasks, making UX more like an outline app, etc.</li>\n<li>Themes, lots of them! Notion and Apple Notes lack this feature.</li>\n<li>Obisidian give the option to create <strong>a daily note</strong> and open it at the beginning of each day. At first, I didn't get the value of it, but now I realize that this default clean place for notes offers a smooth opportunity for any work/research-related notes. No need to spend brain energy to select a proper place for a new note. Just start typing a fresh idea, and later maybe you'll move it to the right place. People have a limited number of good choices made per day, and this feature allows them to save one every day.</li>\n<li>Notes can have custom properties, and some plugins allow to query these properties and generate nice tables, kanban tables, etc. Again I didn't find this helpful feature in Notion. Still, I like the idea of how it is naturally integrated into notes compared to Notion, where database entry is a different sort of data not related to the rest of the notes.</li>\n<li>A cherry on top is a unique way of organizing multiple opened notes in the app — stacked view. It feels like real pieces of paper stacked on each other, and you slide them left and right to switch to the most useful now. Fantastic concept and I hope it will find more adoption in the future in other apps like Visual Studio Code or Web Browsers.</li>\n</ul>\n</li>\n<li>The only issue is a pricing model.\n<ul>\n<li>8$ per month (96$ per year) is a bit too much for built-in cloud syncing, which is useful if you use the app on multiple devices. I'm using iCloud to store notes, which works great across Apple devices, but iCloud is not working in Windows.</li>\n<li>Also, another 50$ per year for a commercial license with no additional features compared to a personal (free) license is a bit of a shame.</li>\n<li>I really liked the tool so decided to spend next year with Obsidian and instead buying a new Call Of Duty I decided to spend this money to Obsidian Cloud Sync 😁</li>\n</ul>\n</li>\n<li>Platforms: all.</li>\n</ul>\n<p><img src=\"/img/for_posts/01/obisidian.png\" alt=\"\"></p>\n<p><strong>Lucidchart</strong></p>\n<ul>\n<li>I used this app only for work since my employer provides a license for it. It's one of the best of its kind.</li>\n<li>The power of diagrams in work life is a topic for another post. As a software engineer, I've been making diagrams since university, and it's an amazing process helping creativity, problem-solving and documenting.</li>\n<li>Previously, I used open-sourced <strong><a href=\"http://Draw.io\">Draw.io</a></strong>, which is also great, but due to its open-source nature, it could be more advanced and polished and has a sharing capability.</li>\n<li>Platforms: all.</li>\n</ul>\n<p><img src=\"/img/for_posts/01/lucidchart.png\" alt=\"...\"></p>\n<p><strong>Cloud Storage</strong></p>\n<ul>\n<li>One of the oldest categories of apps I use. Currently, I use <a href=\"https://disk.yandex.com\">Yandex.Disk</a> because of stable MacOS app work and reliable back-end. I worked for Yandex for seven years and knew the people behind the product. I can trust them :)</li>\n<li>Platforms: all.</li>\n</ul>\n<h2 id=\"system-control\">System control <a class=\"direct-link\" href=\"#system-control\">#</a></h2>\n<p><strong>Raycast</strong></p>\n<ul>\n<li>A recent gem I found. It's an extensible MacOS Spotlight (the one you see on &quot;Cmd + Space&quot;).</li>\n<li>It's quite the same as more mature <a href=\"https://www.alfredapp.com/\">Alfred</a>, but we with much more in free-pack and a more modern (IMHO) look.</li>\n<li>Previously, I used two different apps for the same functions: Spectacle (prev. Rectangle) for windows management and Clipy for clipboard history.</li>\n<li>I use it for:\n<ul>\n<li><strong>Clipboard history</strong>. That's the most frequent feature I use. I also stored images in history with previews and allowed them to paste without formatting.</li>\n<li>Windows Management: move a window to the left-right half, move windows to another display, etc. Second the most frequent feature.</li>\n<li>Opening floating (over everything) notes during the meeting to keep track of the agenda</li>\n<li>Quick calculations.</li>\n</ul>\n</li>\n<li>Platforms: macOS.</li>\n</ul>\n<p><img src=\"/img/for_posts/01/raycast.png\" alt=\"...\"></p>\n<p><strong><a href=\"https://lunar.fyi\">Lunar</a></strong></p>\n<ul>\n<li>Allows controlling brightness both on built-in and external monitors.</li>\n<li>Previously, I used 2 or 3 similar apps, some of them are open-source, but no app managed to work correctly with all the external monitors I use.</li>\n<li>Platforms: macOS.</li>\n</ul>\n<p><img src=\"/img/for_posts/01/lunar.png\" alt=\"...\"></p>\n<p><strong>ITerm 2</strong></p>\n<ul>\n<li>Replacement for MacOS built-in terminal.</li>\n<li>Has tons of features and integrations.</li>\n<li>My current work only assumes a little work in a terminal, but I remember what a great difference it made when I started to use one at my previous job.</li>\n<li>Platforms: macOS.</li>\n</ul>\n<h2 id=\"other\">Other <a class=\"direct-link\" href=\"#other\">#</a></h2>\n<p><strong>Good keyboard and typing skills</strong></p>\n<ul>\n<li>Typing speed is not a help in programming, but the more senior engineer, the more time he can spend on communication, writing a post in a corporate network, documentation, etc.</li>\n<li>To make these tasks faster and more pleasant, I invested some time in typing speed skills and a keyboard with a comfortable typing experience.</li>\n<li>Keyboard\n<ul>\n<li>Home: <strong>NuPhy Air 60</strong>. It's 60% (no Numpad and Fn row), mechanical, low-profile And wireless keyboard. I love its compact size and folio, allowing me to put my iPad mini on a stand. I read and write many things on iPad (including this post), and this keyboard is way better than Apple's offerings for the same tasks in terms of balance between portability and typing experience. I use linear lubed switches with some mods.\n<ul>\n<li><img src=\"/img/for_posts/01/nuphy.png\" alt=\"...\"></li>\n</ul>\n</li>\n<li>Work: <strong>Dygma Raise</strong>. It's a 60% split ergonomic mechanical keyboard with optional tenting capability for a more ergonomic wrist position. I love it for the comfort of typing. One small con is that the sound of typing could be better due to its construction. I use linear lubed switches + some keyboard mods.\n<ul>\n<li><img src=\"/img/for_posts/01/dygma.png\" alt=\"...\"></li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p><strong><a href=\"https://apps.apple.com/us/app/time-out-break-reminders/id402592703?mt=12\">Timeout</a></strong> app from macOS App Store</p>\n<ul>\n<li>Small nice app that reminds me to take a break. I have used it for at least six years.</li>\n<li>Platforms: macOS.</li>\n</ul>\n<p><strong><a href=\"https://app.grammarly.com\">Grammarly</a></strong></p>\n<ul>\n<li>It's a nice service checking grammar, spelling, punctuation and most importantly word selection and sentence structure.</li>\n<li>Platforms: all.</li>\n</ul>\n<p><strong><a href=\"https://macpassapp.org\">MacPass</a></strong></p>\n<ul>\n<li>I use it to <strong>store credentials</strong> to services. I love it for open-source and using local files as a database.</li>\n<li>Database files are encrypted and stored in personal cloud storage.</li>\n<li>There are a lot of more popular alternatives, but almost all of them are online services and engaging browser extension installation. Credentials are one of the most important pieces of a secure online presence, and I cannot afford to store them in 3rd party services, which can (theoretically) vanish the next day and take all my credentials with them.</li>\n<li>Alternatives using the same database format are available on all platforms.</li>\n</ul>\n<p><img src=\"/img/for_posts/01/macpass.png\" alt=\"...\"></p>\n<h2 id=\"conclusion\">Conclusion <a class=\"direct-link\" href=\"#conclusion\">#</a></h2>\n<p>I was developing this set of apps and techniques for a long time, and the journey continues. It seems like a lot, but in reality, almost every app has some predecessors (which I also used) and extends previous experience, so it's pretty easy to learn a new app.<br>\nI know the &quot;productivity&quot; apps field is indefinite, and I'm happy to see you sharing your favourite apps and workflows.</p>\n",
      "date_published": "2022-10-30T00:00:00-00:00"
    }
  ]
}
